cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1237E6PZ.svd
        <register>
          <name>DC8</name>
          <description>Device Capabilities 8 ADC Channels</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC8_ADC0AIN0</name>
              <description>ADC Module 0 AIN0 Pin Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN1</name>
              <description>ADC Module 0 AIN1 Pin Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN2</name>
              <description>ADC Module 0 AIN2 Pin Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN3</name>
              <description>ADC Module 0 AIN3 Pin Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN4</name>
              <description>ADC Module 0 AIN4 Pin Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN5</name>
              <description>ADC Module 0 AIN5 Pin Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN6</name>
              <description>ADC Module 0 AIN6 Pin Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN7</name>
              <description>ADC Module 0 AIN7 Pin Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN8</name>
              <description>ADC Module 0 AIN8 Pin Present</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN9</name>
              <description>ADC Module 0 AIN9 Pin Present</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN10</name>
              <description>ADC Module 0 AIN10 Pin Present</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN11</name>
              <description>ADC Module 0 AIN11 Pin Present</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN12</name>
              <description>ADC Module 0 AIN12 Pin Present</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN13</name>
              <description>ADC Module 0 AIN13 Pin Present</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN14</name>
              <description>ADC Module 0 AIN14 Pin Present</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC0AIN15</name>
              <description>ADC Module 0 AIN15 Pin Present</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN0</name>
              <description>ADC Module 1 AIN0 Pin Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN1</name>
              <description>ADC Module 1 AIN1 Pin Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN2</name>
              <description>ADC Module 1 AIN2 Pin Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN3</name>
              <description>ADC Module 1 AIN3 Pin Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN4</name>
              <description>ADC Module 1 AIN4 Pin Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN5</name>
              <description>ADC Module 1 AIN5 Pin Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN6</name>
              <description>ADC Module 1 AIN6 Pin Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN7</name>
              <description>ADC Module 1 AIN7 Pin Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN8</name>
              <description>ADC Module 1 AIN8 Pin Present</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN9</name>
              <description>ADC Module 1 AIN9 Pin Present</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN10</name>
              <description>ADC Module 1 AIN10 Pin Present</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN11</name>
              <description>ADC Module 1 AIN11 Pin Present</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN12</name>
              <description>ADC Module 1 AIN12 Pin Present</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN13</name>
              <description>ADC Module 1 AIN13 Pin Present</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN14</name>
              <description>ADC Module 1 AIN14 Pin Present</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC8_ADC1AIN15</name>
              <description>ADC Module 1 AIN15 Pin Present</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PBORCTL</name>
          <description>Brown-Out Reset Control</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PBORCTL_BOR1</name>
              <description>VDD under BOR1 Event Action</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PBORCTL_BOR0</name>
              <description>VDD under BOR0 Event Action</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR0</name>
          <description>Software Reset Control 0</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR0_WDT0</name>
              <description>WDT0 Reset Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_HIB</name>
              <description>HIB Reset Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_ADC0</name>
              <description>ADC0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_ADC1</name>
              <description>ADC1 Reset Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_CAN0</name>
              <description>CAN0 Reset Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR0_WDT1</name>
              <description>WDT1 Reset Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR1</name>
          <description>Software Reset Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR1_UART0</name>
              <description>UART0 Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_UART1</name>
              <description>UART1 Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_UART2</name>
              <description>UART2 Reset Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_SSI0</name>
              <description>SSI0 Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_SSI1</name>
              <description>SSI1 Reset Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_I2C0</name>
              <description>I2C0 Reset Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_I2C1</name>
              <description>I2C1 Reset Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER0</name>
              <description>Timer 0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER1</name>
              <description>Timer 1 Reset Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER2</name>
              <description>Timer 2 Reset Control</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_TIMER3</name>
              <description>Timer 3 Reset Control</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP0</name>
              <description>Analog Comp 0 Reset Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP1</name>
              <description>Analog Comp 1 Reset Control</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR1_COMP2</name>
              <description>Analog Comp 2 Reset Control</description>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCR2</name>
          <description>Software Reset Control 2</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCR2_GPIOA</name>
              <description>Port A Reset Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOB</name>
              <description>Port B Reset Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOC</name>
              <description>Port C Reset Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOD</name>
              <description>Port D Reset Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOE</name>
              <description>Port E Reset Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOF</name>
              <description>Port F Reset Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOG</name>
              <description>Port G Reset Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOH</name>
              <description>Port H Reset Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_GPIOJ</name>
              <description>Port J Reset Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_UDMA</name>
              <description>Micro-DMA Reset Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCR2_USB0</name>
              <description>USB0 Reset Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RIS_MOFRIS</name>
              <description>Main Oscillator Fault Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_USBPLLLRIS</name>
              <description>USB PLL Lock Raw Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_VDDARIS</name>
              <description>VDDA Power OK Event Raw Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_IMC_MOFIM</name>
              <description>Main Oscillator Fault Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_USBPLLLIM</name>
              <description>USB PLL Lock Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_VDDAIM</name>
              <description>VDDA Power OK Interrupt Mask</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MISC_MOFMIS</name>
              <description>Main Oscillator Fault Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_USBPLLLMIS</name>
              <description>USB PLL Lock Masked Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_VDDAMIS</name>
              <description>VDDA Power OK Masked Interrupt Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
